# SpotElevIndTypeElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpotElevIndTypeElevation Property
ParameterTypeId Class See Also
---
"Elevation Indicator as Prefix/Suffix"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpotElevIndTypeElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotElevIndTypeElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpotElevIndTypeElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace